# 16. 데이터를 추출하는 다양한 방법
## 16-1. [ ] 이용하기

### - (p.383) 조건을 충족하는 행 추출하기

In [1]:
import pandas as pd
import os

In [3]:
os.chdir('C:\\Users\\James\\Documents\\GitHub\\Doit_Python\\Data')
os.getcwd()

'C:\\Users\\James\\Documents\\GitHub\\Doit_Python\\Data'

In [4]:
df_raw = pd.read_csv('exam.csv')

In [9]:
df = df_raw.head(10)
df

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [6]:
df['nclass'].head()

0    1
1    1
2    1
3    1
4    2
Name: nclass, dtype: int64

In [10]:
df['nclass'] == 1

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8    False
9    False
Name: nclass, dtype: bool

In [11]:
df[df['nclass'] == 1]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [13]:
df[df['math'] >= 80]

   id  nclass  math  english  science
6   7       2    80       90       45
7   8       2    90       78       25

#### * 여러 조건 ( AND == & )

In [14]:
df[(df['nclass'] == 1) & (df['math'] >= 50)]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60

#### * 여러 조건 ( OR == | )

In [15]:
df[(df['math'] < 50) | (df['english'] < 50)]

   id  nclass  math  english  science
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
8   9       3    20       98       15

### - (p386) 열 추출하기

In [17]:
df['id'].head()

0    1
1    2
2    3
3    4
4    5
Name: id, dtype: int64

In [18]:
df['nclass'].head()

0    1
1    1
2    1
3    1
4    2
Name: nclass, dtype: int64

#### * 여러 변수

In [20]:
df[['id', 'nclass']].head()

   id  nclass
0   1       1
1   2       1
2   3       1
3   4       1
4   5       2

#### * 데이터프레임 자료구조 유지

In [23]:
df[['id']].head()

   id
0   1
1   2
2   3
3   4
4   5

#### * 점(.)을 이용해 변수 간단히 추출

In [32]:
# 단, 
# 여러 변수를 추출할 수 없고, 
# 시리즈로만 추출되며, 
# 여러 제약조건이 있어 사용이 불편하고,
# 메서드와 혼동이 생기는 코드가 되므로 비추

In [26]:
df['math'].head()

0    50
1    60
2    45
3    30
4    25
Name: math, dtype: int64

In [28]:
df.math.head()

0    50
1    60
2    45
3    30
4    25
Name: math, dtype: int64

In [29]:
df['math'].mean()

50.0

In [30]:
df.math.mean()

50.0

### - (p.388) 조건을 충족하는 행에서 열 추출하기

In [35]:
# 시리즈 자료구조로
df[df['nclass'] == 1]['math']

0    50
1    60
2    45
3    30
Name: math, dtype: int64

In [36]:
# 데이터프레임 자료구조로 
df[df['nclass'] == 1][['math']]

   math
0    50
1    60
2    45
3    30

In [37]:
df[df['nclass'] == 1][['math', 'english']]

   math  english
0    50       98
1    60       97
2    45       86
3    30       98

#### * [ ] 를 pandas와 함께 사용하기

In [39]:
df.groupby('nclass', as_index = False) \
  .agg(mean_math    = ('math', 'mean'),
       mean_english = ('english', 'mean'))

   nclass  mean_math  mean_english
0       1      46.25         94.75
1       2      61.25         84.25
2       3      35.00         98.00

In [40]:
df.groupby('nclass', as_index = False)[['math', 'english']].mean()

   nclass   math  english
0       1  46.25    94.75
1       2  61.25    84.25
2       3  35.00    98.00

## 16-2. df.loc[ ] 이용하기

In [49]:
df = pd.DataFrame({'var1' : [1, 2, 3],
                   'var2' : [4, 5, 6]})
df

   var1  var2
0     1     4
1     2     5
2     3     6

### - (p.390) 인덱스 문자열 지정

In [52]:
df = pd.DataFrame({'var1' : [1, 2, 3],
                   'var2' : [4, 5, 6]},
                  index = ['kim', 'lee', 'park'])
df

      var1  var2
kim      1     4
lee      2     5
park     3     6

### - (p.391) 인덱스 문자열 지정 행 추출

In [53]:
df.loc['kim']

var1    1
var2    4
Name: kim, dtype: int64

In [54]:
df.loc[['kim', 'park']]

      var1  var2
kim      1     4
park     3     6

### - (p.391) 인덱스 문자열 지정 열 추출

In [55]:
df.loc['lee', 'var1']

2

In [56]:
df.loc[['kim', 'lee'], 'var2']

kim    4
lee    5
Name: var2, dtype: int64

In [46]:
df.loc[['kim', 'lee'], ['var1', 'var2']]

     var1  var2
kim     1     4
lee     2     5

#### * 모든 행 추출

In [57]:
df.loc[:, 'var1']

kim     1
lee     2
park    3
Name: var1, dtype: int64

### - (p.392) 인덱스 번호 지정 행 추출

In [63]:
df = df_raw.copy()
df = df.head(10)
df.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [67]:
# 시리즈 자료구조로 추출
df.loc[0]

id          1
nclass      1
math       50
english    98
science    50
Name: 0, dtype: int64

In [66]:
# 데이터프레임 자료구조로 추출
df.loc[[0]]

   id  nclass  math  english  science
0   1       1    50       98       50

#### * 여러 행 추출

In [68]:
df.loc[[0, 3, 5]]

   id  nclass  math  english  science
0   1       1    50       98       50
3   4       1    30       98       58
5   6       2    50       89       98

#### * 연속된 행 추출

In [70]:
df.loc[0:3]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [71]:
df.loc[7:9]

   id  nclass  math  english  science
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [73]:
df.loc[:2]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78

In [74]:
df.loc[7:]

   id  nclass  math  english  science
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

#### * 모든 행 추출

In [75]:
df.loc[:]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

#### * 인덱스 문자열만 있으면 인덱스 번호로 추출 불가

In [76]:
df_label = pd.DataFrame({'var1' : [1, 2, 3],
                         'var2' : [4, 5, 6]},
                         index = ['kim', 'lee', 'park'])
df_label

      var1  var2
kim      1     4
lee      2     5
park     3     6

In [ ]:
# Error
df_label.loc[0]

In [78]:
df_label.loc['kim']

var1    1
var2    4
Name: kim, dtype: int64

#### * 인덱스 번호로 열 추출 불가

In [79]:
df.loc[2, :]

id          3
nclass      1
math       45
english    86
science    78
Name: 2, dtype: int64

In [ ]:
# Error
df.loc[:, 2]

### - (p.397) 조건을 충족하는 행 추출

In [82]:
df.loc[df['nclass'] == 1]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

#### * 열의 일부만 추출

In [87]:
df.loc[df['nclass'] == 1, ['math', 'english']]

   math  english
0    50       98
1    60       97
2    45       86
3    30       98

In [84]:
# 상동
df[df['nclass'] == 1][['math', 'english']]

   math  english
0    50       98
1    60       97
2    45       86
3    30       98

#### * 여러 방법 비교

##### (1) df.query( )

In [86]:
df.query('math > 50')

   id  nclass  math  english  science
1   2       1    60       97       60
6   7       2    80       90       45
7   8       2    90       78       25

##### (2) df[df[ ]]

In [96]:
df[df['math'] > 50]

   id  nclass  math  english  science
1   2       1    60       97       60
6   7       2    80       90       45
7   8       2    90       78       25

##### (3) df.loc[ ]

In [95]:
df.loc[df['math'] > 50]

   id  nclass  math  english  science
1   2       1    60       97       60
6   7       2    80       90       45
7   8       2    90       78       25

## 16-3. df.iloc[ ] 이용하기

### - (p.399) 인덱스 번호 지정 행 추출

In [87]:
df.iloc[0]

id          1
nclass      1
math       50
english    98
science    50
Name: 0, dtype: int64

In [89]:
# 상동
df.loc[0]

id          1
nclass      1
math       50
english    98
science    50
Name: 0, dtype: int64

#### * 데이터프레임 자료구조 유지

In [90]:
df.iloc[[0]]

   id  nclass  math  english  science
0   1       1    50       98       50

#### * 여러 행 추출

In [91]:
df.iloc[[0, 3, 5]]

   id  nclass  math  english  science
0   1       1    50       98       50
3   4       1    30       98       58
5   6       2    50       89       98

In [92]:
df.iloc[[0, 5, 3]]

   id  nclass  math  english  science
0   1       1    50       98       50
5   6       2    50       89       98
3   4       1    30       98       58

#### * 연속된 행 추출

##### (1) df.loc[x:y] = x행 이상 y행 이하

In [98]:
# df.iloc[] 과 df.loc[] 의 차이
df.loc[0:3]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

##### (2) df.iloc[x:y] = x행 이상 y행 미만

In [100]:
# df.iloc[] 과 df.loc[] 의 차이
df.iloc[0:3]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78

#### * 인덱스 문자열만 있어도 인덱스 번호로 행 추출 가능

In [101]:
df_label

      var1  var2
kim      1     4
lee      2     5
park     3     6

In [102]:
# df_label.loc[0]   # Error
df_label.iloc[0]

var1    1
var2    4
Name: kim, dtype: int64

### - (p.402) 인덱스 번호로 열 추출 가능

In [103]:
# df.loc[:, 1]     # Error
df.iloc[:, 1]

0    1
1    1
2    1
3    1
4    2
5    2
6    2
7    2
8    3
9    3
Name: nclass, dtype: int64

In [104]:
df.iloc[:, [1, 3]]

   nclass  english
0       1       98
1       1       97
2       1       86
3       1       98
4       2       80
5       2       89
6       2       90
7       2       78
8       3       98
9       3       98

In [105]:
df.iloc[2, 3]

86

In [106]:
df.iloc[[0, 1], [1, 2, 3]]

   nclass  math  english
0       1    50       98
1       1    60       97

#### * 조건을 충족하는 행 추출 불가

In [ ]:
# Error
df.iloc[df['nclass'] == 1]

In [109]:
# df.loc 는 조건 지정 가능
df.loc[df['nclass'] == 1]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

## - End.